### Idioms

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]});

In [2]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [3]:
df.loc[df.AAA >= 5,'BBB'] = -1;

In [4]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   -1   50
2    6   -1  -30
3    7   -1  -50

In [5]:
df.loc[df.AAA >=5, ['BBB','CCC']] =555

In [6]:
df

   AAA  BBB  CCC
0    4   10  100
1    5  555  555
2    6  555  555
3    7  555  555

In [7]:
df.loc[df.AAA < 5,['BBB','CCC']] = 2000;

In [8]:
df

   AAA   BBB   CCC
0    4  2000  2000
1    5   555   555
2    6   555   555
3    7   555   555

In [9]:

df_mask = pd.DataFrame({'AAA' : [True] * 4, 'BBB' : [False] * 4,'CCC' : [True,False] * 2})
df_mask

    AAA    BBB    CCC
0  True  False   True
1  True  False  False
2  True  False   True
3  True  False  False

In [10]:
df.where(df_mask,-1000)

   AAA   BBB   CCC
0    4 -1000  2000
1    5 -1000 -1000
2    6 -1000   555
3    7 -1000 -1000

In [11]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]});

In [12]:
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [13]:
df['logic'] = np.where(df['AAA'] >5,'high','low')

In [14]:
df

   AAA  BBB  CCC logic
0    4   10  100   low
1    5   20   50   low
2    6   30  -30  high
3    7   40  -50  high

### Splitting

In [15]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}); 
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [16]:
dflow = df[df.AAA <=5]
dflow

   AAA  BBB  CCC
0    4   10  100
1    5   20   50

In [17]:
dfhigh = df[df.AAA >5]
dfhigh

   AAA  BBB  CCC
2    6   30  -30
3    7   40  -50

### Building Criteria

In [18]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}); 
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [19]:
newSeries = df.loc[(df['BBB'] < 25) & (df['CCC'] >= -40) ,'AAA']
newSeries

0    4
1    5
Name: AAA, dtype: int64

In [20]:
newseries = df.loc[(df['BBB'] < 25) | (df['CCC'] >= -40), 'AAA'];

In [21]:
newseries

0    4
1    5
2    6
Name: AAA, dtype: int64

In [22]:
 df.loc[(df['BBB'] > 25) | (df['CCC'] >= 75), 'AAA'] = 0.1;

In [23]:
df

   AAA  BBB  CCC
0  0.1   10  100
1  5.0   20   50
2  0.1   30  -30
3  0.1   40  -50

In [24]:
# Select rows with data closest to certain value using argsort
df = pd.DataFrame( {'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}); 
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [25]:
aValue = 43.0

In [26]:
df.loc[(df.CCC-aValue).abs().argsort()]

   AAA  BBB  CCC
1    5   20   50
0    4   10  100
2    6   30  -30
3    7   40  -50

In [27]:
## Dynamically reduce a list of criteria using a binary operators
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}); 
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [32]:
crit1 = df.AAA <=5.5

In [33]:
type(crit1)

pandas.core.series.Series

In [34]:
Crit2 = df.BBB == 10.0

In [35]:
Crit3 = df.CCC > -40.0

In [36]:
AllCrit = Crit1 & Crit2 & Crit3

In [37]:
CritList = [Crit1,Crit2,Crit3]

In [38]:
import functools
AllCrit = functools.reduce(lambda x,y: x & y, CritList)
AllCrit

0     True
1    False
2    False
3    False
dtype: bool

In [39]:
df[AllCrit]

   AAA  BBB  CCC
0    4   10  100

### Selection

In [40]:
df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]});
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [41]:
df[(df.AAA <= 6) & (df.index.isin([0,2,4]))]

   AAA  BBB  CCC
0    4   10  100
2    6   30  -30

In [42]:
 data = {'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40],'CCC' : [100,50,-30,-50]}

In [43]:
df = pd.DataFrame(data=data,index=['foo','bar','boo','kar']); 
df

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

here are 2 explicit slicing methods, with a third general case

1. Positional-oriented (Python slicing style : exclusive of end)

2. Label-oriented (Non-Python slicing style : inclusive of end)

3. General (Either slicing style : depends on if the slice contains labels or positions)

In [44]:
df.loc['bar':'kar'] # label

     AAA  BBB  CCC
bar    5   20   50
boo    6   30  -30
kar    7   40  -50

In [45]:
df.iloc[0:3]

     AAA  BBB  CCC
foo    4   10  100
bar    5   20   50
boo    6   30  -30

In [46]:
df2 = pd.DataFrame(data=data,index=[1,2,3,4]); #Note index starts at 1.

In [47]:
df2

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30
4    7   40  -50

In [48]:
df2.loc[1:3]

   AAA  BBB  CCC
1    4   10  100
2    5   20   50
3    6   30  -30

In [49]:
df2.iloc[1:3]

   AAA  BBB  CCC
2    5   20   50
3    6   30  -30

In [50]:
#Using inverse operator (~) to take the complement of a mask

df = pd.DataFrame({'AAA' : [4,5,6,7], 'BBB' : [10,20,30,40], 'CCC' : [100,50,-30,-50]});
df

   AAA  BBB  CCC
0    4   10  100
1    5   20   50
2    6   30  -30
3    7   40  -50

In [51]:
df[~((df.AAA<=6 ) & (df.index.isin([0,2,4])))]

   AAA  BBB  CCC
1    5   20   50
3    7   40  -50

In [52]:
### Panels

In [53]:
rng = pd.date_range('1/1/2013',periods=100,freq='D')

In [54]:
data = np.random.randn(100, 4)

In [55]:
cols = ['A','B','C','D']

In [56]:
df1, df2, df3 = pd.DataFrame(data, rng, cols), pd.DataFrame(data, rng, cols),pd.DataFrame(data, rng, cols)

In [57]:
pf = pd.Panel({'df1':df1,'df2':df2,'df3':df3});
pf

/Users/sanjotraibagkar/anaconda/envs/py36/lib/python3.6/site-packages/IPython/core/interactiveshell.py:2963: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  exec(code_obj, self.user_global_ns, self.user_ns)

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 100 (major_axis) x 4 (minor_axis)
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to D

In [58]:
pf = pf.transpose(2,0,1)

/Users/sanjotraibagkar/anaconda/envs/py36/lib/python3.6/site-packages/pandas/core/panel.py:1268: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  return super(Panel, self).transpose(*axes, **kwargs)

In [59]:
pf['E'] = pd.DataFrame(data, rng, cols)

In [60]:
pf = pf.transpose(1,2,0);

/Users/sanjotraibagkar/anaconda/envs/py36/lib/python3.6/site-packages/pandas/core/panel.py:1268: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  return super(Panel, self).transpose(*axes, **kwargs)

In [61]:
pf.loc[:,:,'F'] = pd.DataFrame(data, rng, cols);
pf

/Users/sanjotraibagkar/anaconda/envs/py36/lib/python3.6/site-packages/pandas/core/generic.py:3707: FutureWarning:
Panel is deprecated and will be removed in a future version.
The recommended way to represent these types of 3-dimensional data are with a MultiIndex on a DataFrame, via the Panel.to_frame() method
Alternatively, you can use the xarray package http://xarray.pydata.org/en/stable/.
Pandas provides a `.to_xarray()` method to help automate this conversion.

  copy=copy, allow_dups=False)

<class 'pandas.core.panel.Panel'>
Dimensions: 3 (items) x 100 (major_axis) x 6 (minor_axis)
Items axis: df1 to df3
Major_axis axis: 2013-01-01 00:00:00 to 2013-04-10 00:00:00
Minor_axis axis: A to F

### New Columns

In [62]:
df = pd.DataFrame({'AAA' : [1,2,1,3], 'BBB' : [1,1,2,2], 'CCC' : [2,1,3,1]});
df

   AAA  BBB  CCC
0    1    1    2
1    2    1    1
2    1    2    3
3    3    2    1

In [63]:
source_cols = df.columns # or some subset would work too.

In [64]:
new_cols = [str(x) + "_cat" for x in source_cols]

In [65]:
categories = {1 : 'Alpha', 2 : 'Beta', 3 : 'Charlie' }

In [66]:
df[new_cols] = df[source_cols].applymap(categories.get);
df

   AAA  BBB  CCC  AAA_cat BBB_cat  CCC_cat
0    1    1    2    Alpha   Alpha     Beta
1    2    1    1     Beta   Alpha    Alpha
2    1    2    3    Alpha    Beta  Charlie
3    3    2    1  Charlie    Beta    Alpha

In [67]:
df = pd.DataFrame({'AAA' : [1,1,1,2,2,2,3,3], 'BBB' : [2,1,3,4,5,1,2,3]});
df

   AAA  BBB
0    1    2
1    1    1
2    1    3
3    2    4
4    2    5
5    2    1
6    3    2
7    3    3

In [68]:
# Method 1 : idxmin() to get the index of the mins
df.loc[df.groupby("AAA")["BBB"].idxmin()]

   AAA  BBB
1    1    1
5    2    1
6    3    2

In [69]:
df.sort_values(by="BBB").groupby("AAA", as_index=False).first()

   AAA  BBB
0    1    1
1    2    1
2    3    2

#### MultiIndexing

In [70]:
df = pd.DataFrame({'row' : [0,1,2],
'One_X' : [1.1,1.1,1.1],
'One_Y' : [1.2,1.2,1.2],
'Two_X' : [1.11,1.11,1.11],
'Two_Y' : [1.22,1.22,1.22]});
df

   row  One_X  One_Y  Two_X  Two_Y
0    0    1.1    1.2   1.11   1.22
1    1    1.1    1.2   1.11   1.22
2    2    1.1    1.2   1.11   1.22

In [71]:
df = df.set_index('row');
df

     One_X  One_Y  Two_X  Two_Y
row
0      1.1    1.2   1.11   1.22
1      1.1    1.2   1.11   1.22
2      1.1    1.2   1.11   1.22

In [72]:
df.columns = pd.MultiIndex.from_tuples([tuple(c.split('_')) for c in df.columns]);

In [73]:
df.columns

MultiIndex(levels=[['One', 'Two'], ['X', 'Y']],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]])

In [74]:
df

     One        Two
       X    Y     X     Y
row
0    1.1  1.2  1.11  1.22
1    1.1  1.2  1.11  1.22
2    1.1  1.2  1.11  1.22

In [75]:
df = df.stack(0).reset_index(1);

In [76]:

df

    level_1     X     Y
row
0       One  1.10  1.20
0       Two  1.11  1.22
1       One  1.10  1.20
1       Two  1.11  1.22
2       One  1.10  1.20
2       Two  1.11  1.22

In [77]:
df.columns = ['Sample','All_X','All_Y'];

In [78]:
df

    Sample  All_X  All_Y
row
0      One   1.10   1.20
0      Two   1.11   1.22
1      One   1.10   1.20
1      Two   1.11   1.22
2      One   1.10   1.20
2      Two   1.11   1.22

Arithmetic

In [79]:
cols = pd.MultiIndex.from_tuples([ (x,y) for x in ['A','B','C'] for y in ['O','I']])

In [80]:
df = pd.DataFrame(np.random.randn(2,6),index=['n','m'],columns=cols); 
df

          A                   B                   C
          O         I         O         I         O         I
n  0.196089 -0.081908  1.319577  0.878895 -1.074490 -0.009153
m -0.277216 -1.283538 -2.367730  0.949996 -0.601796  0.595515

In [81]:
df = df.div(df['C'],level = 1)

In [82]:
df

          A                   B              C
          O         I         O         I    O    I
n -0.182495  8.948732 -1.228096 -96.02274  1.0  1.0
m  0.460648 -2.155341  3.934437   1.59525  1.0  1.0

Slicing

In [83]:
coords = [('AA','one'),('AA','six'),('BB','one'),('BB','two'),('BB','six')]

In [84]:
index = pd.MultiIndex.from_tuples(coords)

In [85]:
df = pd.DataFrame([11,22,33,44,55],index,['MyData']); 
df

        MyData
AA one      11
   six      22
BB one      33
   two      44
   six      55

In [86]:
# Time Searies

In [87]:
import pandas as pd

rng = pd.date_range('1/1/2011', periods=72, freq='H')

In [88]:
rng

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00', '2011-01-01 05:00:00',
               '2011-01-01 06:00:00', '2011-01-01 07:00:00',
               '2011-01-01 08:00:00', '2011-01-01 09:00:00',
               '2011-01-01 10:00:00', '2011-01-01 11:00:00',
               '2011-01-01 12:00:00', '2011-01-01 13:00:00',
               '2011-01-01 14:00:00', '2011-01-01 15:00:00',
               '2011-01-01 16:00:00', '2011-01-01 17:00:00',
               '2011-01-01 18:00:00', '2011-01-01 19:00:00',
               '2011-01-01 20:00:00', '2011-01-01 21:00:00',
               '2011-01-01 22:00:00', '2011-01-01 23:00:00',
               '2011-01-02 00:00:00', '2011-01-02 01:00:00',
               '2011-01-02 02:00:00', '2011-01-02 03:00:00',
               '2011-01-02 04:00:00', '2011-01-02 05:00:00',
               '2011-01-02 06:00:00', '2011-01-02 07:00:00',
               '2011-01-02 08:00:00', '2011-01-02 09:00:00',
               '2011-01-02 10:00:00', '2011-01-02 11:00:00',
               '2011-01-02 12:00:00', '2011-01-02 13:00:00',
               '2011-01-02 14:00:00', '2011-01-02 15:00:00',
               '2011-01-02 16:00:00', '2011-01-02 17:00:00',
               '2011-01-02 18:00:00', '2011-01-02 19:00:00',
               '2011-01-02 20:00:00', '2011-01-02 21:00:00',
               '2011-01-02 22:00:00', '2011-01-02 23:00:00',
               '2011-01-03 00:00:00', '2011-01-03 01:00:00',
               '2011-01-03 02:00:00', '2011-01-03 03:00:00',
               '2011-01-03 04:00:00', '2011-01-03 05:00:00',
               '2011-01-03 06:00:00', '2011-01-03 07:00:00',
               '2011-01-03 08:00:00', '2011-01-03 09:00:00',
               '2011-01-03 10:00:00', '2011-01-03 11:00:00',
               '2011-01-03 12:00:00', '2011-01-03 13:00:00',
               '2011-01-03 14:00:00', '2011-01-03 15:00:00',
               '2011-01-03 16:00:00', '2011-01-03 17:00:00',
               '2011-01-03 18:00:00', '2011-01-03 19:00:00',
               '2011-01-03 20:00:00', '2011-01-03 21:00:00',
               '2011-01-03 22:00:00', '2011-01-03 23:00:00'],
              dtype='datetime64[ns]', freq='H')

In [89]:
rng[:5]

DatetimeIndex(['2011-01-01 00:00:00', '2011-01-01 01:00:00',
               '2011-01-01 02:00:00', '2011-01-01 03:00:00',
               '2011-01-01 04:00:00'],
              dtype='datetime64[ns]', freq='H')

In [90]:
import numpy as np
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [91]:
ts

2011-01-01 00:00:00    1.191490
2011-01-01 01:00:00   -0.657779
2011-01-01 02:00:00   -0.971555
2011-01-01 03:00:00    0.760659
2011-01-01 04:00:00    1.672613
2011-01-01 05:00:00    2.020270
2011-01-01 06:00:00    2.120241
2011-01-01 07:00:00    0.417834
2011-01-01 08:00:00    0.739837
2011-01-01 09:00:00   -0.409492
2011-01-01 10:00:00   -0.839709
2011-01-01 11:00:00    1.590784
2011-01-01 12:00:00    0.181550
2011-01-01 13:00:00    0.127414
2011-01-01 14:00:00   -1.840410
2011-01-01 15:00:00   -0.876355
2011-01-01 16:00:00   -0.143149
2011-01-01 17:00:00   -0.613440
2011-01-01 18:00:00    0.578999
2011-01-01 19:00:00    1.595242
2011-01-01 20:00:00   -0.823079
2011-01-01 21:00:00    0.003653
2011-01-01 22:00:00   -0.126056
2011-01-01 23:00:00   -0.322338
2011-01-02 00:00:00    0.999500
2011-01-02 01:00:00    0.101527
2011-01-02 02:00:00    0.297562
2011-01-02 03:00:00   -0.063132
2011-01-02 04:00:00    0.223157
2011-01-02 05:00:00    0.959867
                         ...
2011-01-02 18:00:00    0.092151
2011-01-02 19:00:00   -0.266945
2011-01-02 20:00:00   -0.569280
2011-01-02 21:00:00   -0.894578
2011-01-02 22:00:00    1.187133
2011-01-02 23:00:00    0.200204
2011-01-03 00:00:00    1.206418
2011-01-03 01:00:00    0.320220
2011-01-03 02:00:00    0.553978
2011-01-03 03:00:00   -0.672122
2011-01-03 04:00:00    0.802707
2011-01-03 05:00:00    0.385619
2011-01-03 06:00:00    0.968299
2011-01-03 07:00:00    0.240518
2011-01-03 08:00:00   -0.573296
2011-01-03 09:00:00   -1.476452
2011-01-03 10:00:00   -0.185562
2011-01-03 11:00:00    1.493154
2011-01-03 12:00:00   -2.312058
2011-01-03 13:00:00    0.513182
2011-01-03 14:00:00    0.347683
2011-01-03 15:00:00   -0.127128
2011-01-03 16:00:00   -0.677997
2011-01-03 17:00:00   -0.441201
2011-01-03 18:00:00   -0.161972
2011-01-03 19:00:00    1.103831
2011-01-03 20:00:00    1.906242
2011-01-03 21:00:00    0.185402
2011-01-03 22:00:00    0.143896
2011-01-03 23:00:00    0.417302
Freq: H, Length: 72, dtype: float64

In [92]:
ts.head()

2011-01-01 00:00:00    1.191490
2011-01-01 01:00:00   -0.657779
2011-01-01 02:00:00   -0.971555
2011-01-01 03:00:00    0.760659
2011-01-01 04:00:00    1.672613
Freq: H, dtype: float64

In [93]:
#Change frequency and fill gaps:
# to 45 minute frequency and forward fill

In [94]:
converted = ts.asfreq('45Min', method='pad')

In [95]:
converted.head()

2011-01-01 00:00:00    1.191490
2011-01-01 00:45:00    1.191490
2011-01-01 01:30:00   -0.657779
2011-01-01 02:15:00   -0.971555
2011-01-01 03:00:00    0.760659
Freq: 45T, dtype: float64

In [96]:
# Daily means
ts.resample('D').mean()

2011-01-01    0.224051
2011-01-02    0.034963
2011-01-03    0.165028
Freq: D, dtype: float64

Timestamp --Represents a single time stamp -- to_datetime, Timestamp
DatetimeIndex -- Index of Timestamps --to_datetime, date_range, DatetimeIndex
Period Represents a single time span Period
PeriodIndex Index of Period period_range, PeriodIndex

In [97]:

pd.Timestamp(pd.datetime(2012, 5, 1))

Timestamp('2012-05-01 00:00:00')

In [98]:
pd.Timestamp('2012-05-01')

Timestamp('2012-05-01 00:00:00')

In [99]:
pd.Period('2011-01')

Period('2011-01', 'M')

In [100]:
pd.Period('2011-01', 'M')

Period('2011-01', 'M')

In [101]:
pd.Period('2012-05', freq='D')

Period('2012-05-01', 'D')

In [102]:
dates = [pd.Timestamp('2012-05-01'), pd.Timestamp('2012-05-02'), pd.Timestamp('2012-05-03')]

In [103]:
dates

[Timestamp('2012-05-01 00:00:00'),
 Timestamp('2012-05-02 00:00:00'),
 Timestamp('2012-05-03 00:00:00')]

In [104]:
ts = pd.Series(np.random.randn(3), dates)

In [105]:
ts

2012-05-01   -1.177050
2012-05-02    0.862144
2012-05-03   -0.995439
dtype: float64

In [106]:
type(ts.index)

pandas.core.indexes.datetimes.DatetimeIndex

In [107]:
ts.index

DatetimeIndex(['2012-05-01', '2012-05-02', '2012-05-03'], dtype='datetime64[ns]', freq=None)

In [108]:
ts

2012-05-01   -1.177050
2012-05-02    0.862144
2012-05-03   -0.995439
dtype: float64

In [109]:
periods = [pd.Period('2012-01'), pd.Period('2012-02'), pd.Period('2012-03')]

In [110]:
periods

[Period('2012-01', 'M'), Period('2012-02', 'M'), Period('2012-03', 'M')]

In [111]:
ts = pd.Series(np.random.randn(3), periods)

In [112]:
ts

2012-01    1.107831
2012-02    0.031986
2012-03    0.378385
Freq: M, dtype: float64

In [113]:
type(ts.index)

pandas.core.indexes.period.PeriodIndex

In [114]:
ts.index

PeriodIndex(['2012-01', '2012-02', '2012-03'], dtype='period[M]', freq='M')

In [115]:
ts

2012-01    1.107831
2012-02    0.031986
2012-03    0.378385
Freq: M, dtype: float64

In [116]:
# Converting to Timestamps

In [117]:
pd.to_datetime(pd.Series(['Jul 31, 2009', '2010-01-10', None]))

0   2009-07-31
1   2010-01-10
2          NaT
dtype: datetime64[ns]

In [118]:
pd.to_datetime(['2005/11/23', '2010.12.31'])

DatetimeIndex(['2005-11-23', '2010-12-31'], dtype='datetime64[ns]', freq=None)

In [119]:
pd.to_datetime('2010/11/12')

Timestamp('2010-11-12 00:00:00')

In [120]:
pd.Timestamp('2010/11/12')

Timestamp('2010-11-12 00:00:00')

In [121]:
pd.to_datetime(['2009/07/31', 'asd'], errors='raise')

ValueError: ('Unknown string format:', 'asd')

In [122]:
pd.to_datetime(['2009/07/31', 'asd'], errors='ignore')

array(['2009/07/31', 'asd'], dtype=object)

In [123]:
pd.to_datetime(['2009/07/31', 'asd'], errors='coerce')

DatetimeIndex(['2009-07-31', 'NaT'], dtype='datetime64[ns]', freq=None)

In [124]:
# Epoch Timestamps

In [125]:
import pandas as pd
import numpy as np
pd.to_datetime([0,7200,1349720105, 1349806505, 1349892905,1349979305, 1350065705], unit='s'
              ,origin = pd.Timestamp('20180101'))

DatetimeIndex(['2018-01-01 00:00:00', '2018-01-01 02:00:00',
               '2060-10-08 18:15:05', '2060-10-09 18:15:05',
               '2060-10-10 18:15:05', '2060-10-11 18:15:05',
               '2060-10-12 18:15:05'],
              dtype='datetime64[ns]', freq=None)

In [126]:
pd.to_datetime([1349720105100, 1349720105200, 1349720105300,1349720105400, 1349720105500 ], 
            unit='ms',origin = pd.Timestamp('20180101'))

DatetimeIndex(['2060-10-08 18:15:05.100000', '2060-10-08 18:15:05.200000',
               '2060-10-08 18:15:05.300000', '2060-10-08 18:15:05.400000',
               '2060-10-08 18:15:05.500000'],
              dtype='datetime64[ns]', freq=None)

In [127]:
pd.to_datetime([93601],unit='s')

DatetimeIndex(['1970-01-02 02:00:01'], dtype='datetime64[ns]', freq=None)

In [128]:

pd.to_datetime([1, 3.14], unit='s')

DatetimeIndex(['1970-01-01 00:00:01', '1970-01-01 00:00:03.140000'], dtype='datetime64[ns]', freq=None)

In [129]:
# Generating Ranges of Timestamps

In [130]:
dates = [pd.datetime(2012, 5, 1), pd.datetime(2012, 5, 2), pd.datetime(2012, 5, 3)]

In [131]:
dates

[datetime.datetime(2012, 5, 1, 0, 0),
 datetime.datetime(2012, 5, 2, 0, 0),
 datetime.datetime(2012, 5, 3, 0, 0)]

In [132]:
index = pd.DatetimeIndex(dates)

In [133]:
index = pd.Index(dates)

In [134]:
index = pd.date_range('2000-1-1', periods=1000, freq='M')

In [135]:
index = pd.bdate_range('2012-1-1', periods=250)

In [136]:
start = pd.datetime(2011, 1, 1)

In [137]:
end = pd.datetime(2012, 1, 1)

In [138]:
rng = pd.date_range(start, end)

In [139]:
rng

DatetimeIndex(['2011-01-01', '2011-01-02', '2011-01-03', '2011-01-04',
               '2011-01-05', '2011-01-06', '2011-01-07', '2011-01-08',
               '2011-01-09', '2011-01-10',
               ...
               '2011-12-23', '2011-12-24', '2011-12-25', '2011-12-26',
               '2011-12-27', '2011-12-28', '2011-12-29', '2011-12-30',
               '2011-12-31', '2012-01-01'],
              dtype='datetime64[ns]', length=366, freq='D')

In [140]:
rng = pd.bdate_range(start, end)

In [141]:
rng

DatetimeIndex(['2011-01-03', '2011-01-04', '2011-01-05', '2011-01-06',
               '2011-01-07', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-14',
               ...
               '2011-12-19', '2011-12-20', '2011-12-21', '2011-12-22',
               '2011-12-23', '2011-12-26', '2011-12-27', '2011-12-28',
               '2011-12-29', '2011-12-30'],
              dtype='datetime64[ns]', length=260, freq='B')

In [142]:
pd.date_range(start, end, freq='BM')

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-29',
               '2011-05-31', '2011-06-30', '2011-07-29', '2011-08-31',
               '2011-09-30', '2011-10-31', '2011-11-30', '2011-12-30'],
              dtype='datetime64[ns]', freq='BM')

In [143]:
pd.date_range(start, end, freq='M')

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-30',
               '2011-05-31', '2011-06-30', '2011-07-31', '2011-08-31',
               '2011-09-30', '2011-10-31', '2011-11-30', '2011-12-31'],
              dtype='datetime64[ns]', freq='M')

In [144]:
pd.date_range(start, end, freq='W')

DatetimeIndex(['2011-01-02', '2011-01-09', '2011-01-16', '2011-01-23',
               '2011-01-30', '2011-02-06', '2011-02-13', '2011-02-20',
               '2011-02-27', '2011-03-06', '2011-03-13', '2011-03-20',
               '2011-03-27', '2011-04-03', '2011-04-10', '2011-04-17',
               '2011-04-24', '2011-05-01', '2011-05-08', '2011-05-15',
               '2011-05-22', '2011-05-29', '2011-06-05', '2011-06-12',
               '2011-06-19', '2011-06-26', '2011-07-03', '2011-07-10',
               '2011-07-17', '2011-07-24', '2011-07-31', '2011-08-07',
               '2011-08-14', '2011-08-21', '2011-08-28', '2011-09-04',
               '2011-09-11', '2011-09-18', '2011-09-25', '2011-10-02',
               '2011-10-09', '2011-10-16', '2011-10-23', '2011-10-30',
               '2011-11-06', '2011-11-13', '2011-11-20', '2011-11-27',
               '2011-12-04', '2011-12-11', '2011-12-18', '2011-12-25',
               '2012-01-01'],
              dtype='datetime64[ns]', freq='W-SUN')

In [145]:
pd.bdate_range(end=end, periods=20)

DatetimeIndex(['2011-12-05', '2011-12-06', '2011-12-07', '2011-12-08',
               '2011-12-09', '2011-12-12', '2011-12-13', '2011-12-14',
               '2011-12-15', '2011-12-16', '2011-12-19', '2011-12-20',
               '2011-12-21', '2011-12-22', '2011-12-23', '2011-12-26',
               '2011-12-27', '2011-12-28', '2011-12-29', '2011-12-30'],
              dtype='datetime64[ns]', freq='B')

In [146]:
pd.bdate_range(start=start, periods=20)

DatetimeIndex(['2011-01-03', '2011-01-04', '2011-01-05', '2011-01-06',
               '2011-01-07', '2011-01-10', '2011-01-11', '2011-01-12',
               '2011-01-13', '2011-01-14', '2011-01-17', '2011-01-18',
               '2011-01-19', '2011-01-20', '2011-01-21', '2011-01-24',
               '2011-01-25', '2011-01-26', '2011-01-27', '2011-01-28'],
              dtype='datetime64[ns]', freq='B')

In [147]:
# DatetimeIndex

In [148]:
rng = pd.date_range(start, end, freq='BM')

In [149]:
ts = pd.Series(np.random.randn(len(rng)), index=rng)

In [150]:
ts.index

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-29',
               '2011-05-31', '2011-06-30', '2011-07-29', '2011-08-31',
               '2011-09-30', '2011-10-31', '2011-11-30', '2011-12-30'],
              dtype='datetime64[ns]', freq='BM')

In [151]:
ts[:5].index

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-29',
               '2011-05-31'],
              dtype='datetime64[ns]', freq='BM')

In [152]:
ts[:5].index

DatetimeIndex(['2011-01-31', '2011-02-28', '2011-03-31', '2011-04-29',
               '2011-05-31'],
              dtype='datetime64[ns]', freq='BM')

In [153]:
ts[::2].index

DatetimeIndex(['2011-01-31', '2011-03-31', '2011-05-31', '2011-07-29',
               '2011-09-30', '2011-11-30'],
              dtype='datetime64[ns]', freq='2BM')

In [154]:
#DatetimeIndex Partial String Indexing

In [155]:
ts['1/31/2011']

-0.23959543876119382

In [156]:
ts[pd.datetime(2011, 12, 25):]

2011-12-30    1.558101
Freq: BM, dtype: float64

In [157]:
ts['10/31/2011':'12/31/2011']

2011-10-31    0.304342
2011-11-30   -1.213941
2011-12-30    1.558101
Freq: BM, dtype: float64

In [158]:
ts['2011']

2011-01-31   -0.239595
2011-02-28   -0.557373
2011-03-31    0.664492
2011-04-29    0.653137
2011-05-31   -0.188900
2011-06-30   -1.433747
2011-07-29   -1.189412
2011-08-31   -0.393654
2011-09-30   -1.345050
2011-10-31    0.304342
2011-11-30   -1.213941
2011-12-30    1.558101
Freq: BM, dtype: float64

In [159]:
ts['2011-6']

2011-06-30   -1.433747
Freq: BM, dtype: float64

In [160]:
# Truncating & Fancy Indexing

In [161]:
ts.truncate(before='10/31/2011', after='12/31/2011')

2011-10-31    0.304342
2011-11-30   -1.213941
2011-12-30    1.558101
Freq: BM, dtype: float64

In [162]:
ts[[0, 2, 6]].index

DatetimeIndex(['2011-01-31', '2011-03-31', '2011-07-29'], dtype='datetime64[ns]', freq=None)

# Time/Date Components


Property -Description

year -The year of the datetime

month- The month of the datetime

day -The days of the datetime

hour -The hour of the datetime

minute- The minutes of the datetime

second -The seconds of the datetime

microsecond- The microseconds of the datetime

nanosecond -The nanoseconds of the datetime

date- Returns datetime.date

time -Returns datetime.time

dayofyear- The ordinal day of year

weekofyear -The week ordinal of the year

week- The week ordinal of the year

dayofweek- The day of the week with Monday=0, Sunday=6

weekday- The day of the week with Monday=0, Sunday=6

quarter- Quarter of the date: Jan=Mar = 1, Apr-Jun = 2, etc.

days_in_month- The number of days in the month of the datetime

is_month_start- Logical indicating if first day of month (defined by frequency)

is_month_end- Logical indicating if last day of month (defined by frequency)

is_quarter_start- Logical indicating if first day of quarter (defined by frequency)

is_quarter_end -Logical indicating if last day of quarter (defined by frequency)

is_year_start -Logical indicating if first day of year (defined by frequency)

is_year_end -Logical indicating if last day of year (defined by frequency)


DateOffset objects


Class name -- Description

DateOffset Generic offset class, defaults to 1 calendar day

BDay business day (weekday)


CDay custom business day (experimental)

Week one week, optionally anchored on a day of the week

WeekOfMonth the x-th day of the y-th week of each month

LastWeekOfMonth the x-th day of the last week of each month

MonthEnd calendar month end

MonthBegin calendar month begin

BMonthEnd business month end

BMonthBegin business month begin

CBMonthEnd custom business month end

CBMonthBegin custom business month begin

QuarterEnd calendar quarter end

QuarterBegin calendar quarter begin

BQuarterEnd business quarter end

BQuarterBegin business quarter begin

FY5253Quarter retail (aka 52-53 week) quarter

YearEnd calendar year end

YearBegin calendar year begin

BYearEnd business year end

BYearBegin business year begin

FY5253 retail (aka 52-53 week) year

BusinessHour business hour


Hour one hour

Minute one minute

Second one second

Milli one millisecond

Micro one microsecond

Nano one nanosecond

In [163]:
d = pd.datetime(2008, 8, 18, 9, 0)

In [164]:
from pandas.tseries.offsets import *

In [165]:
d + DateOffset(months=4, days=5)

Timestamp('2008-12-23 09:00:00')

In [166]:
class BDay(DateOffset):
"""DateOffset increments between business days"""
    def apply(self, other):

IndentationError: expected an indented block (<ipython-input-166-4298424ac3ee>, line 2)

In [167]:
d - 5 * BDay()

Timestamp('2008-08-11 09:00:00')

In [168]:
d + BMonthEnd()

Timestamp('2008-08-29 09:00:00')

In [169]:
d

datetime.datetime(2008, 8, 18, 9, 0)

In [170]:
offset = BMonthEnd()

In [171]:
offset

In [172]:
offset.rollforward(d)

Timestamp('2008-08-29 09:00:00')

In [173]:
offset.rollback(d)

Timestamp('2008-07-31 09:00:00')

In [174]:
day = 2*Day()

In [175]:
day.apply(pd.Timestamp('2014-01-01 09:00'))

Timestamp('2014-01-03 09:00:00')

In [176]:
day = Day(normalize=True)

In [177]:
day.apply(pd.Timestamp('2014-01-01 09:00'))

Timestamp('2014-01-02 00:00:00')

In [178]:
hour = Hour()

In [179]:
hour.apply(pd.Timestamp('2014-01-01 22:00'))

Timestamp('2014-01-01 23:00:00')

In [180]:
hour = Hour(normalize=True)

In [181]:
hour.apply(pd.Timestamp('2014-01-01 22:00'))

Timestamp('2014-01-01 00:00:00')

In [182]:
hour.apply(pd.Timestamp('2014-01-01 23:00'))

Timestamp('2014-01-02 00:00:00')

In [183]:
#Parametric offsets

In [184]:
d

datetime.datetime(2008, 8, 18, 9, 0)

In [185]:
d + Week()

Timestamp('2008-08-25 09:00:00')

In [186]:
d + Week(weekday=4)

Timestamp('2008-08-22 09:00:00')

In [187]:
(d + Week(weekday=4)).weekday()

4

In [188]:
d - Week()

Timestamp('2008-08-11 09:00:00')

In [189]:
d + Week(normalize=True)

Timestamp('2008-08-25 00:00:00')

In [190]:
d - Week(normalize=True)

Timestamp('2008-08-11 00:00:00')

In [191]:
d + YearEnd()

Timestamp('2008-12-31 09:00:00')

In [192]:
d + YearEnd(month=6)

Timestamp('2009-06-30 09:00:00')

In [193]:
d + YearEnd()

Timestamp('2008-12-31 09:00:00')

In [194]:
d + YearEnd(month=6)

Timestamp('2009-06-30 09:00:00')

In [195]:
# Using offsets with Series / DatetimeIndex

In [196]:
rng = pd.date_range('2012-01-01', '2012-01-03')

In [197]:
s = pd.Series(rng)

In [198]:
rng

DatetimeIndex(['2012-01-01', '2012-01-02', '2012-01-03'], dtype='datetime64[ns]', freq='D')

In [199]:
rng + DateOffset(months=2)

DatetimeIndex(['2012-03-01', '2012-03-02', '2012-03-03'], dtype='datetime64[ns]', freq='D')

In [200]:
s + DateOffset(months=2)

0   2012-03-01
1   2012-03-02
2   2012-03-03
dtype: datetime64[ns]

In [201]:
s - DateOffset(months=2)

0   2011-11-01
1   2011-11-02
2   2011-11-03
dtype: datetime64[ns]

In [202]:
s - Day(2)

0   2011-12-30
1   2011-12-31
2   2012-01-01
dtype: datetime64[ns]

In [203]:
td = s - pd.Series(pd.date_range('2011-12-29', '2011-12-31'))

In [204]:
td

0   3 days
1   3 days
2   3 days
dtype: timedelta64[ns]

In [205]:
td + Minute(15)

0   3 days 00:15:00
1   3 days 00:15:00
2   3 days 00:15:00
dtype: timedelta64[ns]

In [206]:
rng + BQuarterEnd()

DatetimeIndex(['2012-03-30', '2012-03-30', '2012-03-30'], dtype='datetime64[ns]', freq='D')

In [207]:
# Custom Business Days
from pandas.tseries.offsets import CustomBusinessDay

In [208]:
weekmask_egypt = 'Sun Mon Tue Wed Thu'

In [209]:
holidays = ['2012-05-01', pd.datetime(2013, 5, 1), np.datetime64('2014-05-01')]

In [210]:
holidays

['2012-05-01',
 datetime.datetime(2013, 5, 1, 0, 0),
 numpy.datetime64('2014-05-01')]

In [211]:
bday_egypt = CustomBusinessDay(holidays=holidays, weekmask=weekmask_egypt)

In [212]:
bday_egypt

In [213]:
dt = pd.datetime(2013, 4, 30)

In [214]:
dt + 2 * bday_egypt

Timestamp('2013-05-05 00:00:00')

In [215]:
dts = pd.date_range(dt, periods=5, freq=bday_egypt)

In [216]:
dts

DatetimeIndex(['2013-04-30', '2013-05-02', '2013-05-05', '2013-05-06',
               '2013-05-07'],
              dtype='datetime64[ns]', freq='C')

In [217]:
pd.Series(dts.weekday, dts).map(pd.Series('Mon Tue Wed Thu Fri Sat Sun'.split()))

2013-04-30    Tue
2013-05-02    Thu
2013-05-05    Sun
2013-05-06    Mon
2013-05-07    Tue
Freq: C, dtype: object

In [218]:
from pandas.tseries.holiday import USFederalHolidayCalendar

In [219]:
bday_us = CustomBusinessDay(calendar=USFederalHolidayCalendar())

In [220]:
dt = pd.datetime(2014, 1, 17)

In [221]:
# # Tuesday after MLK Day (Monday is skipped because it's a holiday)

In [222]:
dt + bday_us

Timestamp('2014-01-21 00:00:00')

In [223]:
from pandas.tseries.offsets import CustomBusinessMonthBegin

In [224]:
bmth_us = CustomBusinessMonthBegin(calendar=USFederalHolidayCalendar())

In [225]:
# # Skip new years

In [226]:
dt = pd.datetime(2013, 12, 17)

In [227]:
dt + bmth_us

Timestamp('2014-01-02 00:00:00')

In [228]:
from pandas import DatetimeIndex

In [229]:
DatetimeIndex(start='20100101',end='20120101',freq=bmth_us)

DatetimeIndex(['2010-01-04', '2010-02-01', '2010-03-01', '2010-04-01',
               '2010-05-03', '2010-06-01', '2010-07-01', '2010-08-02',
               '2010-09-01', '2010-10-01', '2010-11-01', '2010-12-01',
               '2011-01-03', '2011-02-01', '2011-03-01', '2011-04-01',
               '2011-05-02', '2011-06-01', '2011-07-01', '2011-08-01',
               '2011-09-01', '2011-10-03', '2011-11-01', '2011-12-01'],
              dtype='datetime64[ns]', freq='CBMS')

In [230]:
#Business Hour

In [231]:
bh = BusinessHour()

In [232]:
bh

In [233]:
# 2014-08-01 is Friday
pd.Timestamp('2014-08-01 10:00').weekday()

4

In [234]:
pd.Timestamp('2014-08-01 10:00') + bh

Timestamp('2014-08-01 11:00:00')

In [235]:
#Below example is the same as Timestamp('2014-08-01 09:00') + bh

In [236]:
pd.Timestamp('2014-08-01 08:00') + bh

Timestamp('2014-08-01 10:00:00')

In [237]:
pd.Timestamp('2014-08-01 16:00') + bh

Timestamp('2014-08-04 09:00:00')

In [238]:
# # Remainings are added to the next day

In [239]:
pd.Timestamp('2014-08-01 16:30') + bh

Timestamp('2014-08-04 09:30:00')

In [240]:
# # Adding 2 business hours

In [241]:
pd.Timestamp('2014-08-01 10:00') + BusinessHour(2)

Timestamp('2014-08-01 12:00:00')

In [242]:
# Subtracting 3 business hours

In [243]:
pd.Timestamp('2014-08-01 10:00') + BusinessHour(-3)

Timestamp('2014-07-31 15:00:00')

In [244]:
bh = BusinessHour(start='11:00', end='20:00')

In [245]:
bh

In [246]:
pd.Timestamp('2014-08-01 13:00') + bh

Timestamp('2014-08-01 14:00:00')

In [247]:
pd.Timestamp('2014-08-01 09:00') + bh

Timestamp('2014-08-01 12:00:00')

In [248]:
pd.Timestamp('2014-08-01 18:00') + bh

Timestamp('2014-08-01 19:00:00')

In [249]:
bh = BusinessHour(start='17:00', end='09:00')

In [250]:
pd.Timestamp('2014-08-01 17:00') + bh

Timestamp('2014-08-01 18:00:00')

In [251]:
pd.Timestamp('2014-08-01 23:00') + bh

Timestamp('2014-08-02 00:00:00')

In [252]:
# Frequency conversion

In [253]:
dr = pd.date_range('1/1/2010', periods=3, freq=3 * pd.datetools.bday)

/Users/sanjotraibagkar/anaconda/envs/py36/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: pandas.core.datetools.bday is deprecated and will be removed in a future version.
  """Entry point for launching an IPython kernel.

In [254]:
ts = pd.Series(np.random.randn(3), index=dr)

In [255]:
ts

2010-01-01   -1.226975
2010-01-06    1.715575
2010-01-11    0.402401
Freq: 3B, dtype: float64

In [256]:
ts.asfreq(BDay())

2010-01-01   -1.226975
2010-01-04         NaN
2010-01-05         NaN
2010-01-06    1.715575
2010-01-07         NaN
2010-01-08         NaN
2010-01-11    0.402401
Freq: B, dtype: float64

In [257]:
ts.asfreq(BDay(), method='pad')

2010-01-01   -1.226975
2010-01-04   -1.226975
2010-01-05   -1.226975
2010-01-06    1.715575
2010-01-07    1.715575
2010-01-08    1.715575
2010-01-11    0.402401
Freq: B, dtype: float64

In [258]:
    # Resampling

In [259]:
rng = pd.date_range('1/1/2012', periods=100, freq='S')

In [260]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)

In [261]:
ts.resample('5Min').sum()

2012-01-01    25293
Freq: 5T, dtype: int64

In [262]:
ts.resample('5Min').mean()

2012-01-01    252.93
Freq: 5T, dtype: float64

In [263]:
ts.resample('5Min').ohlc()

            open  high  low  close
2012-01-01   210   498    2    126

In [264]:
ts.resample('5Min').max()

2012-01-01    498
Freq: 5T, dtype: int64

In [265]:
ts.resample('5Min', closed='right').mean()

2011-12-31 23:55:00    210.000000
2012-01-01 00:00:00    253.363636
Freq: 5T, dtype: float64

In [266]:
ts.resample('5Min', closed='left').mean()

2012-01-01    252.93
Freq: 5T, dtype: float64

In [267]:
ts.resample('5Min').mean() # by default label='right'

2012-01-01    252.93
Freq: 5T, dtype: float64

In [268]:
ts.resample('5Min', label='left').mean()

2012-01-01    252.93
Freq: 5T, dtype: float64

In [269]:
ts.resample('5Min', label='left', loffset='1s').mean()

2012-01-01 00:00:01    252.93
dtype: float64

In [270]:
## Up Sampling

In [271]:
# from secondly to every 250 milliseconds
ts[:2].resample('250L').asfreq()

2012-01-01 00:00:00.000    210.0
2012-01-01 00:00:00.250      NaN
2012-01-01 00:00:00.500      NaN
2012-01-01 00:00:00.750      NaN
2012-01-01 00:00:01.000    152.0
Freq: 250L, dtype: float64

In [272]:
ts[:2].resample('250L').ffill()

2012-01-01 00:00:00.000    210
2012-01-01 00:00:00.250    210
2012-01-01 00:00:00.500    210
2012-01-01 00:00:00.750    210
2012-01-01 00:00:01.000    152
Freq: 250L, dtype: int64

In [273]:
ts[:2].resample('250L').ffill(limit=2)

2012-01-01 00:00:00.000    210.0
2012-01-01 00:00:00.250    210.0
2012-01-01 00:00:00.500    210.0
2012-01-01 00:00:00.750      NaN
2012-01-01 00:00:01.000    152.0
Freq: 250L, dtype: float64